# Найдите наименьшее простое число, которое является одним из восьми простых чисел, 
# полученных заменой части цифр (не обязательно соседних) одинаковыми цифрами.

from datetime import datetime


def euler51():
    # 1 вариант
    start_time = datetime.now()
    pass
    print(datetime.now() - start_time)

    # 2 вариант
    start_time = datetime.now()
    pass
    print(datetime.now() - start_time)


if __name__ == "__main__":
    euler51()
