# Найдите наименьшее простое число, которое является одним из восьми простых чисел, 
# полученных заменой части цифр (не обязательно соседних) одинаковыми цифрами.

from project_euler_defs import *

# 1 вариант
start_time = datetime.now()
pass
print(datetime.now() - start_time)

# 2 вариант
start_time = datetime.now()
pass
print(datetime.now() - start_time)
